In [1]:
import numpy as np
import pandas as pd

In [9]:
dataset=pd.read_csv( "petrolstation.csv")

In [10]:
dataset.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Pump Price Rs/ Liter,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,S.No,Customer Name,Address,City/Location,HSD,PMG,District,District 1,Province,Province
1,133,CHINAR PETROLEUM SERVICE,"Mouza Chatra Wasti, Tehsil Abbas Pur Poonch","Abbas Pur, AJK",85.95,77.47,AJK,AJK,AJK,KPK
2,6846,CHINAR PETROLEUM SERVICE,"Mouza Chatra Wasti, Tehsil Abbas Pur Poonch Distt","Abbas Pur, AJK",127.26,116.6,AJK,AJK,AJK,KPK
3,5964,MURSHID FILLING STATION,SUDHAN GALI ROAD BAGH CITY AJK,NaN,127.26,116.60,AJK,AJK,AJK,KPK
4,798,NEW KARAKURAM PET SERVICE,ASTORE CITY,ASTORE,84.51,95.83,AJK,AJK,AJK,KPK

In [11]:
dataset.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Pump Price Rs/ Liter,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
10655,Mustang,2,Mustang,Balochistan,NaN,NaN,NaN,NaN,NaN,NaN
10656,N Waziristan,5,N Waziristan,FATA,NaN,NaN,NaN,NaN,NaN,NaN
10657,Ghotki,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10658,Bajaur,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10659,Grand Total,8550,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
x=dataset[['Unnamed: 0','Unnamed: 1','Unnamed: 2']]

In [13]:
x

,Unnamed: 0,Unnamed: 1,Unnamed: 2
0,S.No,Customer Name,Address
1,133,CHINAR PETROLEUM SERVICE,"Mouza Chatra Wasti, Tehsil Abbas Pur Poonch"
2,6846,CHINAR PETROLEUM SERVICE,"Mouza Chatra Wasti, Tehsil Abbas Pur Poonch Distt"
3,5964,MURSHID FILLING STATION,SUDHAN GALI ROAD BAGH CITY AJK
4,798,NEW KARAKURAM PET SERVICE,ASTORE CITY
...,...,...,...
10655,Mustang,2,Mustang
10656,N Waziristan,5,N Waziristan
10657,Ghotki,NaN,NaN
10658,Bajaur,NaN,NaN
10659,Grand Total,8550,NaN

In [14]:
dataset.lenght()

AttributeError: 'DataFrame' object has no attribute 'lenght'

In [15]:
dataset.size()

TypeError: 'numpy.int32' object is not callable

In [16]:
dataset.len()

AttributeError: 'DataFrame' object has no attribute 'len'

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10660 entries, 0 to 10659
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            10660 non-null  object
 1   Unnamed: 1            10657 non-null  object
 2   Unnamed: 2            9884 non-null   object
 3   Unnamed: 3            5390 non-null   object
 4   Pump Price Rs/ Liter  10256 non-null  object
 5   Unnamed: 5            10256 non-null  object
 6   Unnamed: 6            9948 non-null   object
 7   Unnamed: 7            8551 non-null   object
 8   Unnamed: 8            10256 non-null  object
 9   Unnamed: 9            10256 non-null  object
dtypes: object(10)
memory usage: 832.9+ KB

In [20]:
len(dataset)

10660

In [21]:
from sklearn.impute import SimpleImputer

In [26]:
Imputer=SimpleImputer(missing_value=NaN,stratergy='mean')

NameError: name 'NaN' is not defined

In [27]:
Imputer=imputer.fit(x(1:3))

SyntaxError: invalid syntax (359660410.py, line 1)